docs/mediciones/perf/k6-console-auth-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/comisiones-load.js
        output: json (/output/k6-auth-run2.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  00.5s/30s

running (0m02.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.5s/30s

running (0m03.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  02.5s/30s

running (0m04.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  03.5s/30s

running (0m05.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  04.5s/30s

running (0m06.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  05.5s/30s

running (0m07.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  06.5s/30s

running (0m08.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  07.5s/30s

running (0m09.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  08.5s/30s

running (0m10.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  09.5s/30s

running (0m11.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  10.5s/30s

running (0m12.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  11.5s/30s

running (0m13.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  12.5s/30s

running (0m14.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  13.5s/30s

running (0m15.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  14.5s/30s

running (0m16.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  15.5s/30s

running (0m17.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  16.5s/30s

running (0m18.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  17.5s/30s

running (0m19.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  18.5s/30s

running (0m20.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  19.5s/30s

running (0m21.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  20.5s/30s

running (0m22.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  21.5s/30s

running (0m23.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  22.5s/30s

running (0m24.0s), 50/50 VUs, 1147 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  23.5s/30s

running (0m25.0s), 50/50 VUs, 1188 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  24.5s/30s

running (0m26.0s), 50/50 VUs, 1220 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  25.5s/30s

running (0m27.0s), 50/50 VUs, 1264 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  26.5s/30s

running (0m28.0s), 50/50 VUs, 1310 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  27.5s/30s

running (0m29.0s), 50/50 VUs, 1358 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  28.5s/30s

running (0m30.0s), 50/50 VUs, 1408 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  29.5s/30s

running (0m31.0s), 45/50 VUs, 1455 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

     ✓ status es 200
     ✓ no es error 5xx

     checks.........................: 100.00% 3000 out of 3000
     data_received..................: 1.3 MB  43 kB/s
     data_sent......................: 1.5 MB  50 kB/s
     http_req_blocked...............: avg=68.82µs  min=2.38µs  med=9.08µs   max=10.19ms  p(90)=21.1µs   p(95)=42.68µs 
     http_req_connecting............: avg=46.52µs  min=0s      med=0s       max=8.91ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=19.37ms  min=4.9ms   med=13.97ms  max=379.81ms p(90)=32.03ms  p(95)=43.48ms 
       { expected_response:true }...: avg=19.37ms  min=4.9ms   med=13.97ms  max=379.81ms p(90)=32.03ms  p(95)=43.48ms 
   ✓ http_req_failed................: 0.00%   0 out of 1503
     http_req_receiving.............: avg=528.99µs min=30.05µs med=274.21µs max=24.81ms  p(90)=1.05ms   p(95)=1.46ms  
     http_req_sending...............: avg=68.67µs  min=4.76µs  med=30.68µs  max=5.64ms   p(90)=102.35µs p(95)=181.03µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=18.78ms  min=4.72ms  med=13.48ms  max=379.13ms p(90)=31.2ms   p(95)=42.38ms 
     http_reqs......................: 1503    48.304496/s
     iteration_duration.............: avg=1.02s    min=1s      med=1.01s    max=1.15s    p(90)=1.03s    p(95)=1.04s   
     iterations.....................: 1500    48.208079/s
     vus............................: 44      min=44           max=50
     vus_max........................: 50      min=50           max=50


running (0m31.1s), 00/50 VUs, 1500 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s