docs/mediciones/perf/k6-console-auth-run3.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/comisiones-load.js
        output: json (/output/k6-auth-run3.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  00.6s/30s

running (0m02.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.6s/30s

running (0m03.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  02.6s/30s

running (0m04.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  03.6s/30s

running (0m05.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  04.6s/30s

running (0m06.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  05.6s/30s

running (0m07.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  06.6s/30s

running (0m08.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  07.6s/30s

running (0m09.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  08.6s/30s

running (0m10.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  09.6s/30s

running (0m11.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  10.6s/30s

running (0m12.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  11.6s/30s

running (0m13.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  12.6s/30s

running (0m14.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  13.6s/30s

running (0m15.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  14.6s/30s

running (0m16.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  15.6s/30s

running (0m17.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  16.6s/30s

running (0m18.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  17.6s/30s

running (0m19.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  18.6s/30s

running (0m20.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  19.6s/30s

running (0m21.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  20.6s/30s

running (0m22.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  21.6s/30s

running (0m23.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  22.6s/30s

running (0m24.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  23.6s/30s

running (0m25.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  24.6s/30s

running (0m26.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  25.6s/30s

running (0m27.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  26.6s/30s

running (0m28.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  27.6s/30s

running (0m29.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  28.6s/30s

running (0m30.0s), 50/50 VUs, 1447 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  29.6s/30s

running (0m31.0s), 24/50 VUs, 1476 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

     ✓ status es 200
     ✓ no es error 5xx

     checks.........................: 100.00% 3000 out of 3000
     data_received..................: 1.3 MB  43 kB/s
     data_sent......................: 1.5 MB  50 kB/s
     http_req_blocked...............: avg=22.73µs  min=1.62µs  med=9.22µs   max=2.02ms   p(90)=22.63µs  p(95)=43.32µs 
     http_req_connecting............: avg=5.62µs   min=0s      med=0s       max=1.01ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=18.3ms   min=4.3ms   med=15.84ms  max=354.89ms p(90)=31.43ms  p(95)=37.05ms 
       { expected_response:true }...: avg=18.3ms   min=4.3ms   med=15.84ms  max=354.89ms p(90)=31.43ms  p(95)=37.05ms 
   ✓ http_req_failed................: 0.00%   0 out of 1503
     http_req_receiving.............: avg=492.75µs min=26.74µs med=250.16µs max=11.24ms  p(90)=1.14ms   p(95)=1.67ms  
     http_req_sending...............: avg=61.75µs  min=5.31µs  med=31.12µs  max=4.15ms   p(90)=101.43µs p(95)=179.63µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=17.75ms  min=4.15ms  med=15.3ms   max=354.42ms p(90)=30.88ms  p(95)=36.05ms 
     http_reqs......................: 1503    48.474481/s
     iteration_duration.............: avg=1.01s    min=1s      med=1.01s    max=1.06s    p(90)=1.03s    p(95)=1.03s   
     iterations.....................: 1500    48.377726/s
     vus............................: 22      min=22           max=50
     vus_max........................: 50      min=50           max=50


running (0m31.0s), 00/50 VUs, 1500 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s